[
  {
    "id": 1,
    "name": "Boris",
    "type": "European",
    "source": "My Father's Dragon (books)",
    "info": "Boris was the dragon that Elmer Elevator rescued as a baby in the series of novels beginning with My Father's Dragon by Ruth Stiles Gannett."
  },
  {
    "id": 2,
    "name": "Eborsisk",
    "type": "2-headed",
    "source": "Willow (film)",
    "info": "The Eborsisk was named in honor of Roger Ebert and Gene Siskel. It transforms from a troll after being prodded by Willow with the magic wand."
  },
  {
    "id": 3,
    "name": "Falkor",
    "type": "Asian",
    "source": "The Neverending Story (film)",
    "info": "Falkor was a white, furry luck dragon who was a companion to the main characters in several Neverending Story films."
  },
  {
    "id": 4,
    "name": "Norbert",
    "type": "European (book illustrations) or Wyvern (film)",
    "source": "Harry Potter and the Sorcerer's Stone (book and film)",
    "info": "Norbert was a Norwegian Ridgeback dragon that Hagrid tried to raise in his hut on the school grounds of Hogwards School of Witchcraft and Wizardry in the first Harry Potter book (by J.K. Rowling) and film."
  },
  {
    "id": 5,
    "name": "Smaug",
    "type": "European (book) or Wyvern (film)",
    "source": "The Hobbit (book and film series)",
    "info": "Smaug was a magical, treasure-hoarding, centuries-old dragon and antagonist in The Hobbit book (by J.R.R. Tolkein) and film."
  },
  {
    "id": 6,
    "name": "Drogon, Viserion, and Rhaegal",
    "type": "Wyvern",
    "source": "A Song of Ice and Fire series (books), Game of Thrones (television)",
    "info": "Daenerys Stormborn's three dragons, hatched from eggs that were thought to be fossilized, when burned with her on Khal Drogo's pyre."
  },
  {
    "id": 7,
    "name": "Ran and Shaw",
    "type": "Asian",
    "source": "Avatar: The Last Airbender (television)",
    "info": "Ran and Shaw were the Masters of the Sun Warriors, firebenders who respected Firebending as an art learned from the original source."
  }
]
